spec/cassettes/app_create_subscription.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/customers
    body:
      encoding: US-ASCII
      string: card[number]=4242424242424242&card[exp_month]=12&card[exp_year]=30&card[cvc]=222&metadata[country_code]=NL&metadata[is_company]=false&metadata[other]=random
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.14.0
      Authorization:
      - "<AUTH>"
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.14.0","lang":"ruby","lang_version":"2.1.1 p76 (2014-02-24)","platform":"x86_64-darwin13.0","publisher":"stripe","uname":"Darwin
        Mattiass-MacBook-Air.local 13.0.0 Darwin Kernel Version 13.0.0: Thu Sep 19
        22:22:27 PDT 2013; root:xnu-2422.1.72~6/RELEASE_X86_64 x86_64"}'
      Content-Length:
      - '156'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Sat, 26 Jul 2014 10:32:49 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '1396'
      Stripe-Version:
      - '2014-03-13'
      Access-Control-Allow-Credentials:
      - 'true'
      Cache-Control:
      - no-cache, no-store
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Max-Age:
      - '300'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "object": "customer",
          "created": 1406370769,
          "id": "cus_4TPI59NpAJ9Xuk",
          "livemode": false,
          "description": null,
          "email": null,
          "delinquent": false,
          "metadata": {
            "country_code": "NL",
            "is_company": "false",
            "other": "random"
          },
          "subscriptions": {
            "object": "list",
            "total_count": 0,
            "has_more": false,
            "url": "/v1/customers/cus_4TPI59NpAJ9Xuk/subscriptions",
            "data": [],
            "count": 0
          },
          "discount": null,
          "account_balance": 0,
          "currency": null,
          "cards": {
            "object": "list",
            "total_count": 1,
            "has_more": false,
            "url": "/v1/customers/cus_4TPI59NpAJ9Xuk/cards",
            "data": [
              {
                "id": "card_14KSTt2nHroS7mLXzkwrkms9",
                "object": "card",
                "last4": "4242",
                "brand": "Visa",
                "funding": "credit",
                "exp_month": 12,
                "exp_year": 2030,
                "fingerprint": "0K7oMWAQAFG7TEob",
                "country": "US",
                "name": null,
                "address_line1": null,
                "address_line2": null,
                "address_city": null,
                "address_state": null,
                "address_zip": null,
                "address_country": null,
                "cvc_check": "pass",
                "address_line1_check": null,
                "address_zip_check": null,
                "customer": "cus_4TPI59NpAJ9Xuk",
                "type": "Visa"
              }
            ],
            "count": 1
          },
          "default_card": "card_14KSTt2nHroS7mLXzkwrkms9"
        }
    http_version: 
  recorded_at: Sat, 26 Jul 2014 10:32:50 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/plans/test
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.14.0
      Authorization:
      - "<AUTH>"
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.14.0","lang":"ruby","lang_version":"2.1.1 p76 (2014-02-24)","platform":"x86_64-darwin13.0","publisher":"stripe","uname":"Darwin
        Mattiass-MacBook-Air.local 13.0.0 Darwin Kernel Version 13.0.0: Thu Sep 19
        22:22:27 PDT 2013; root:xnu-2422.1.72~6/RELEASE_X86_64 x86_64"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Sat, 26 Jul 2014 10:32:50 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '273'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Cache-Control:
      - no-cache, no-store
      Access-Control-Max-Age:
      - '300'
      Stripe-Version:
      - '2014-03-13'
      Access-Control-Allow-Credentials:
      - 'true'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "interval": "month",
          "name": "Test Plan",
          "created": 1406291550,
          "amount": 1499,
          "currency": "usd",
          "id": "test",
          "object": "plan",
          "livemode": false,
          "interval_count": 1,
          "trial_period_days": null,
          "metadata": {},
          "statement_description": null
        }
    http_version: 
  recorded_at: Sat, 26 Jul 2014 10:32:51 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/customers/cus_4TPI59NpAJ9Xuk
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.14.0
      Authorization:
      - "<AUTH>"
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.14.0","lang":"ruby","lang_version":"2.1.1 p76 (2014-02-24)","platform":"x86_64-darwin13.0","publisher":"stripe","uname":"Darwin
        Mattiass-MacBook-Air.local 13.0.0 Darwin Kernel Version 13.0.0: Thu Sep 19
        22:22:27 PDT 2013; root:xnu-2422.1.72~6/RELEASE_X86_64 x86_64"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Sat, 26 Jul 2014 10:32:51 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '1396'
      Cache-Control:
      - no-cache, no-store
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Stripe-Version:
      - '2014-03-13'
      Access-Control-Max-Age:
      - '300'
      Access-Control-Allow-Credentials:
      - 'true'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "object": "customer",
          "created": 1406370769,
          "id": "cus_4TPI59NpAJ9Xuk",
          "livemode": false,
          "description": null,
          "email": null,
          "delinquent": false,
          "metadata": {
            "country_code": "NL",
            "is_company": "false",
            "other": "random"
          },
          "subscriptions": {
            "object": "list",
            "total_count": 0,
            "has_more": false,
            "url": "/v1/customers/cus_4TPI59NpAJ9Xuk/subscriptions",
            "data": [],
            "count": 0
          },
          "discount": null,
          "account_balance": 0,
          "currency": null,
          "cards": {
            "object": "list",
            "total_count": 1,
            "has_more": false,
            "url": "/v1/customers/cus_4TPI59NpAJ9Xuk/cards",
            "data": [
              {
                "id": "card_14KSTt2nHroS7mLXzkwrkms9",
                "object": "card",
                "last4": "4242",
                "brand": "Visa",
                "funding": "credit",
                "exp_month": 12,
                "exp_year": 2030,
                "fingerprint": "0K7oMWAQAFG7TEob",
                "country": "US",
                "name": null,
                "address_line1": null,
                "address_line2": null,
                "address_city": null,
                "address_state": null,
                "address_zip": null,
                "address_country": null,
                "cvc_check": "pass",
                "address_line1_check": null,
                "address_zip_check": null,
                "customer": "cus_4TPI59NpAJ9Xuk",
                "type": "Visa"
              }
            ],
            "count": 1
          },
          "default_card": "card_14KSTt2nHroS7mLXzkwrkms9"
        }
    http_version: 
  recorded_at: Sat, 26 Jul 2014 10:32:52 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/invoiceitems
    body:
      encoding: US-ASCII
      string: customer=cus_4TPI59NpAJ9Xuk&amount=314&currency=usd&description=VAT
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.14.0
      Authorization:
      - "<AUTH>"
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.14.0","lang":"ruby","lang_version":"2.1.1 p76 (2014-02-24)","platform":"x86_64-darwin13.0","publisher":"stripe","uname":"Darwin
        Mattiass-MacBook-Air.local 13.0.0 Darwin Kernel Version 13.0.0: Thu Sep 19
        22:22:27 PDT 2013; root:xnu-2422.1.72~6/RELEASE_X86_64 x86_64"}'
      Content-Length:
      - '67'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Sat, 26 Jul 2014 10:32:52 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '293'
      Access-Control-Max-Age:
      - '300'
      Access-Control-Allow-Credentials:
      - 'true'
      Cache-Control:
      - no-cache, no-store
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Stripe-Version:
      - '2014-03-13'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "object": "invoiceitem",
          "id": "ii_14KSTw2nHroS7mLXIMD4MSwo",
          "date": 1406370772,
          "amount": 314,
          "livemode": false,
          "proration": false,
          "currency": "usd",
          "customer": "cus_4TPI59NpAJ9Xuk",
          "description": "VAT",
          "metadata": {},
          "invoice": null,
          "subscription": null
        }
    http_version: 
  recorded_at: Sat, 26 Jul 2014 10:32:53 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/customers/cus_4TPI59NpAJ9Xuk/subscriptions
    body:
      encoding: US-ASCII
      string: plan=test
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.14.0
      Authorization:
      - "<AUTH>"
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.14.0","lang":"ruby","lang_version":"2.1.1 p76 (2014-02-24)","platform":"x86_64-darwin13.0","publisher":"stripe","uname":"Darwin
        Mattiass-MacBook-Air.local 13.0.0 Darwin Kernel Version 13.0.0: Thu Sep 19
        22:22:27 PDT 2013; root:xnu-2422.1.72~6/RELEASE_X86_64 x86_64"}'
      Content-Length:
      - '9'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Sat, 26 Jul 2014 10:32:54 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '736'
      Cache-Control:
      - no-cache, no-store
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Max-Age:
      - '300'
      Stripe-Version:
      - '2014-03-13'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "sub_4TPIsuYEAQI2pr",
          "plan": {
            "interval": "month",
            "name": "Test Plan",
            "created": 1406291550,
            "amount": 1499,
            "currency": "usd",
            "id": "test",
            "object": "plan",
            "livemode": false,
            "interval_count": 1,
            "trial_period_days": null,
            "metadata": {},
            "statement_description": null
          },
          "object": "subscription",
          "start": 1406370773,
          "status": "active",
          "customer": "cus_4TPI59NpAJ9Xuk",
          "cancel_at_period_end": false,
          "current_period_start": 1406370773,
          "current_period_end": 1409049173,
          "ended_at": null,
          "trial_start": null,
          "trial_end": null,
          "canceled_at": null,
          "quantity": 1,
          "application_fee_percent": null,
          "discount": null,
          "metadata": {}
        }
    http_version: 
  recorded_at: Sat, 26 Jul 2014 10:32:54 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/invoices?customer=cus_4TPI59NpAJ9Xuk&limit=1
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.14.0
      Authorization:
      - "<AUTH>"
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.14.0","lang":"ruby","lang_version":"2.1.1 p76 (2014-02-24)","platform":"x86_64-darwin13.0","publisher":"stripe","uname":"Darwin
        Mattiass-MacBook-Air.local 13.0.0 Darwin Kernel Version 13.0.0: Thu Sep 19
        22:22:27 PDT 2013; root:xnu-2422.1.72~6/RELEASE_X86_64 x86_64"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Sat, 26 Jul 2014 10:32:55 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '2519'
      Cache-Control:
      - no-cache, no-store
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Max-Age:
      - '300'
      Stripe-Version:
      - '2014-03-13'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "object": "list",
          "has_more": false,
          "url": "/v1/invoices",
          "data": [
            {
              "date": 1406370773,
              "id": "in_14KSTx2nHroS7mLXkNDr3iCF",
              "period_start": 1406370773,
              "period_end": 1406370773,
              "lines": {
                "object": "list",
                "total_count": 2,
                "has_more": false,
                "url": "/v1/invoices/in_14KSTx2nHroS7mLXkNDr3iCF/lines",
                "data": [
                  {
                    "id": "ii_14KSTw2nHroS7mLXIMD4MSwo",
                    "object": "line_item",
                    "type": "invoiceitem",
                    "livemode": false,
                    "amount": 314,
                    "currency": "usd",
                    "proration": false,
                    "period": {
                      "start": 1406370772,
                      "end": 1406370772
                    },
                    "quantity": null,
                    "plan": null,
                    "description": "VAT",
                    "metadata": {}
                  },
                  {
                    "id": "sub_4TPIsuYEAQI2pr",
                    "object": "line_item",
                    "type": "subscription",
                    "livemode": false,
                    "amount": 1499,
                    "currency": "usd",
                    "proration": false,
                    "period": {
                      "start": 1406370773,
                      "end": 1409049173
                    },
                    "quantity": 1,
                    "plan": {
                      "interval": "month",
                      "name": "Test Plan",
                      "created": 1406291550,
                      "amount": 1499,
                      "currency": "usd",
                      "id": "test",
                      "object": "plan",
                      "livemode": false,
                      "interval_count": 1,
                      "trial_period_days": null,
                      "metadata": {},
                      "statement_description": null
                    },
                    "description": null,
                    "metadata": {}
                  }
                ],
                "count": 2
              },
              "subtotal": 1813,
              "total": 1813,
              "customer": "cus_4TPI59NpAJ9Xuk",
              "object": "invoice",
              "attempted": true,
              "closed": true,
              "forgiven": false,
              "paid": true,
              "livemode": false,
              "attempt_count": 1,
              "amount_due": 1813,
              "currency": "usd",
              "starting_balance": 0,
              "ending_balance": 0,
              "next_payment_attempt": null,
              "webhooks_delivered_at": null,
              "charge": "ch_14KSTx2nHroS7mLXwz9Rxm5T",
              "discount": null,
              "application_fee": null,
              "subscription": "sub_4TPIsuYEAQI2pr",
              "metadata": {},
              "statement_description": null,
              "description": null
            }
          ],
          "count": 1
        }
    http_version: 
  recorded_at: Sat, 26 Jul 2014 10:32:55 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/invoices/in_14KSTx2nHroS7mLXkNDr3iCF
    body:
      encoding: US-ASCII
      string: metadata[country_code]=NL&metadata[is_company]=false&metadata[other]=random
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.14.0
      Authorization:
      - "<AUTH>"
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.14.0","lang":"ruby","lang_version":"2.1.1 p76 (2014-02-24)","platform":"x86_64-darwin13.0","publisher":"stripe","uname":"Darwin
        Mattiass-MacBook-Air.local 13.0.0 Darwin Kernel Version 13.0.0: Thu Sep 19
        22:22:27 PDT 2013; root:xnu-2422.1.72~6/RELEASE_X86_64 x86_64"}'
      Content-Length:
      - '75'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Sat, 26 Jul 2014 10:32:56 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '2157'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Cache-Control:
      - no-cache, no-store
      Access-Control-Max-Age:
      - '300'
      Stripe-Version:
      - '2014-03-13'
      Access-Control-Allow-Credentials:
      - 'true'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "date": 1406370773,
          "id": "in_14KSTx2nHroS7mLXkNDr3iCF",
          "period_start": 1406370773,
          "period_end": 1406370773,
          "lines": {
            "object": "list",
            "total_count": 2,
            "has_more": false,
            "url": "/v1/invoices/in_14KSTx2nHroS7mLXkNDr3iCF/lines",
            "data": [
              {
                "id": "ii_14KSTw2nHroS7mLXIMD4MSwo",
                "object": "line_item",
                "type": "invoiceitem",
                "livemode": false,
                "amount": 314,
                "currency": "usd",
                "proration": false,
                "period": {
                  "start": 1406370772,
                  "end": 1406370772
                },
                "quantity": null,
                "plan": null,
                "description": "VAT",
                "metadata": {}
              },
              {
                "id": "sub_4TPIsuYEAQI2pr",
                "object": "line_item",
                "type": "subscription",
                "livemode": false,
                "amount": 1499,
                "currency": "usd",
                "proration": false,
                "period": {
                  "start": 1406370773,
                  "end": 1409049173
                },
                "quantity": 1,
                "plan": {
                  "interval": "month",
                  "name": "Test Plan",
                  "created": 1406291550,
                  "amount": 1499,
                  "currency": "usd",
                  "id": "test",
                  "object": "plan",
                  "livemode": false,
                  "interval_count": 1,
                  "trial_period_days": null,
                  "metadata": {},
                  "statement_description": null
                },
                "description": null,
                "metadata": {}
              }
            ],
            "count": 2
          },
          "subtotal": 1813,
          "total": 1813,
          "customer": "cus_4TPI59NpAJ9Xuk",
          "object": "invoice",
          "attempted": true,
          "closed": true,
          "forgiven": false,
          "paid": true,
          "livemode": false,
          "attempt_count": 1,
          "amount_due": 1813,
          "currency": "usd",
          "starting_balance": 0,
          "ending_balance": 0,
          "next_payment_attempt": null,
          "webhooks_delivered_at": null,
          "charge": "ch_14KSTx2nHroS7mLXwz9Rxm5T",
          "discount": null,
          "application_fee": null,
          "subscription": "sub_4TPIsuYEAQI2pr",
          "metadata": {
            "country_code": "NL",
            "is_company": "false",
            "other": "random"
          },
          "statement_description": null,
          "description": null
        }
    http_version: 
  recorded_at: Sat, 26 Jul 2014 10:32:57 GMT
recorded_with: VCR 2.9.2
